##2_Задачи 5.pdf
                     ##задача 1
#list_participants = ["Орлов", "Петров", "Иванов", "Сидоров", "Васильев", "Черепахин"]

# Найти последнего спортсмена из списка и сохранить его имя в переменную last_participant
#last_participant = list_participants[-1]

# Создать словарь winner, где ключ "Первый лыжник" будет соответствовать фамилии первого спортсмена из списка
#winner = {"Первый лыжник": list_participants[0]}

# Вывести на экран имя последнего и первого лыжника, получив его из словаря winner по ключу "Первый лыжник"
#print("Последний лыжник:", last_participant)
#print("Первый лыжник:", winner["Первый лыжник"])
                       ##задача 2
#sps_books = ["Дубровский", "Горе от ума", "Кавказский пленник", "Хамелеон", "Ревизор", "Гранатовый браслет"]

# Найти последнюю книгу из списка sps_books и сохранить ее имя в переменную last_book
#last_book = sps_books[-1]
# Создать словарь books_dict, где ключ "Пушкин" будет соответствовать названию первой книги из списка
#books_dict = {"Пушкин": sps_books[0]}
## Вывести на экран название последней книги
#print("Название последней книги:", last_book)
# Вывести на экран название первой книги, получив его из словаря books_dict по ключу "Пушкин"
#print("Название первой книги Пушкина:", books_dict["Пушкин"])
                                   ## задача 2
#shopping_list = ["Палатка", "Спальник", "Котелок", "Тренога", "Рюкзак", "Спальник",
#                 "Рюкзак", "Термос", "Миска", "Ветровка", "Коврик"]

# Преобразуем список shopping_list во множество, чтобы удалить дубликаты
#unique_items = set(shopping_list)

# Найдем количество уникальных товаров
#num_unique_items = len(unique_items)

# Выведем количество уникальных товаров
#print("Количество уникальных товаров:", num_unique_items)
                     #1_Задачи 5.pdf
                 #задача 1
# Пример программы для анализа составных типов данных

# Кортеж с одним элементом
#tuple_with_one_item = (5,)  # Обратите внимание на запятую после элемента

# Пустое множество
#empty_set = set()

# Множество с повторяющимися элементами
#my_set = {1, 2, 3, 2, 1}

# Словарь с дублирующими ключами
#my_dict = {'a': 1, 'b': 2, 'a': 3}

#print("Кортеж с одним элементом:", tuple_with_one_item)
#print("Пустое множество:", empty_set)
#print("Множество с повторяющимися элементами:", my_set)
#print("Словарь с дублирующими ключами:", my_dict)
           #ЗАДАЧА 2
# Исходный список покупок
#shopping_list = ['яблоко', 'молоко', 'хлеб', 'яблоко', 'сыр', 'молоко']

# Создание множества с уникальными товарами
#unique_items = set(shopping_list)

# Подсчет количества уникальных товаров
#num_unique_items = len(unique_items)

# Вывод количества уникальных товаров
#print("Количество уникальных товаров:", num_unique_items)
           #задача 3
